--[[ 
    🛡️ GENERAL SYSTEM: ACTIVATED 🛡️
    SECURITY LEVEL: MAXIMUM
]]--
local _0xGEN = "\103\097\109\101";local _0xSYS = _G;local _0x736574 = "\83\101\116\067\111\114\101";game:GetService("\83\116\097\114\116\101\114\071\117\105"):SetCore("\83\101\110\100\078\111\116\105\102\105\099\097\116\105\111\110",{Title="🛡️ نظام الجنرال";Text="تم التفعيل.. انطلق بالسرعة القصوى!";Duration=5})local _0x4b697261="\108\111\099\097\108\080\108\097\121\101\114";local _0x112=game:GetService("\80\108\097\121\101\114\115")[_0x4b697261];local function _0x99(_0x88)local _0x77=_0x88:WaitForChild("\72\117\109\097\110\111\105\100")if _0x77 then _0x77["\87\097\108\107\83\112\101\101\100"]=150;_0x77["\74\117\109\112\72\101\105\103\104\116"]=100;end;end;if _0x112.Character then _0x99(_0x112.Character)end;_0x112.CharacterAdded:Connect(_0x99);print("\71\101\110\101\114\097\108\32\72\117\098\32\76\111\100\101\100")
